Функция ПолучитьСписокДоступныхОрганизаций() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	TK_СоответствияОрганизаций.Организация
	|ИЗ
	|	РегистрСведений.TK_СоответствияОрганизаций КАК TK_СоответствияОрганизаций
	|СГРУППИРОВАТЬ ПО
	|	TK_СоответствияОрганизаций.Организация");
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.ВыгрузитьКолонку("Организация");
	
КонецФункции



Функция ПолучитьНовыйИдентификатор() Экспорт
	Возврат Строка(Новый УникальныйИдентификатор());
КонецФункции



Функция ПолучитьВнешнююСсылкуНаДокументЗаказаЦенПоставщикам(СсылкаНаЗаказ) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	TK_СоответствияДокументовЗапросаЦенПоставщикам.ВнешнийİD
	|ИЗ
	|	РегистрСведений.TK_СоответствияДокументовЗапросаЦенПоставщикам КАК TK_СоответствияДокументовЗапросаЦенПоставщикам
	|ГДЕ
	|	TK_СоответствияДокументовЗапросаЦенПоставщикам.ДокументЗапроса = &Ссылка" );
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаЗаказ);
	Выборка = Запрос.Выполнить().Выбрать();
	
	СсылкаНаДокумент = "";
	Если Выборка.Следующий() Тогда
		СсылкаНаДокумент = СтрШаблон("https://teklifo.com/rqf/%1",Выборка.ВнешнийİD);
	КонецЕсли;
	
	Возврат СсылкаНаДокумент;
КонецФункции



Функция ПолучитьСтатусДокументаЗаказаЦенПоставщику(СсылкаНаЗаказ) Экспорт
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	TK_СтатусыДокументовИнтеграцииСрезПоследних.СтатусДокумента
	|ИЗ
	|	РегистрСведений.TK_СтатусыДокументовИнтеграции.СрезПоследних(, Документ = &СсылкаНаЗаказ) КАК
	|		TK_СтатусыДокументовИнтеграцииСрезПоследних" );
	Запрос.УстановитьПараметр("СсылкаНаЗаказ", СсылкаНаЗаказ);
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	Возврат Выборка.СтатусДокумента;
КонецФункции


Процедура УстановитьСтатусДокументаЗаказаЦенПоставщику(СсылкаНаЗаказ,Статус) Экспорт
	
	МенеджерЗаписи = РегистрыСведений.TK_СтатусыДокументовИнтеграции.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Период = ТекущаяДатаСеанса();
	МенеджерЗаписи.Документ = СсылкаНаЗаказ;
	МенеджерЗаписи.СтатусДокумента = Статус;
	МенеджерЗаписи.Записать();
КонецПроцедуры

