Функция ПолучитьСписокДоступныхОрганизаций() Экспорт
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	TK_СоответствияОрганизаций.Организация
	|ИЗ
	|	РегистрСведений.TK_СоответствияОрганизаций КАК TK_СоответствияОрганизаций
	|СГРУППИРОВАТЬ ПО
	|	TK_СоответствияОрганизаций.Организация");
	
	Результат = Запрос.Выполнить().Выгрузить();
	
	Возврат Результат.ВыгрузитьКолонку("Организация");
	
КонецФункции



Функция ПолучитьНовыйИдентификатор() Экспорт
	Возврат Строка(Новый УникальныйИдентификатор());
КонецФункции