
&Вместо("УчетныеМеханизмыКонфигурации")
Функция TK_УчетныеМеханизмыКонфигурации() Экспорт
	МеханизмыКонфигурации = Новый Структура;
	
	МеханизмыКонфигурации.Вставить("АдресныйСклад", "СкладыСервер");
	МеханизмыКонфигурации.Вставить("Взаиморасчеты", "ВзаиморасчетыСервер");
	МеханизмыКонфигурации.Вставить("ВнутреннееТовародвижение", "ВнутреннееТовародвижение");
	МеханизмыКонфигурации.Вставить("Закупки", "Закупки");


	МеханизмыКонфигурации.Вставить("Обеспечение", "РаспределениеЗапасовДвижения");
	МеханизмыКонфигурации.Вставить("ОборотныеРегистрыУправленческогоУчета", "УправленческийУчетПроведениеСервер");
	МеханизмыКонфигурации.Вставить("ОперативныйУчетТоваровОрганизаций", "ЗапасыСервер");
	МеханизмыКонфигурации.Вставить("ПередачаНаОтветхранение", "ПередачаНаОтветхранение");
	МеханизмыКонфигурации.Вставить("ПланированиеЗапасов", "Планирование");
	МеханизмыКонфигурации.Вставить("ПланированиеКонтрольДенежныхСредств", "ЛимитыРасходованияДенежныхСредствСервер");
	МеханизмыКонфигурации.Вставить("ПодарочныеСертификаты", "ПодарочныеСертификатыСервер");
	МеханизмыКонфигурации.Вставить("ПриемНаОтветхранение", "ПриемНаОтветхранение");
	МеханизмыКонфигурации.Вставить("Продажи", "Продажи");
	МеханизмыКонфигурации.Вставить("ОформлениеОтчетовКомитентуОЗакупках", "РегистрыНакопления.ТоварыУслугиКОформлениюОтчетовКомитентуОЗакупках");

	МеханизмыКонфигурации.Вставить("РасчетыСПодотчетниками", "РегистрыНакопления.ДенежныеСредстваУПодотчетныхЛиц");
	МеханизмыКонфигурации.Вставить("РеестрДокументов", "РегистрыСведений.РеестрДокументов");
	МеханизмыКонфигурации.Вставить("СебестоимостьИПартионныйУчет", "ПартионныйУчетСервер");
	МеханизмыКонфигурации.Вставить("СерийныйУчет", "РегистрыНакопления.ДвиженияСерийТоваров");
	МеханизмыКонфигурации.Вставить("СуммыДокументовВВалютахУчета", "РегистрыСведений.СуммыДокументовВВалютахУчета");
	МеханизмыКонфигурации.Вставить("УправлениеАссортиментом", "АссортиментСервер");
	МеханизмыКонфигурации.Вставить("УчетДенежныхСредств", "ДенежныеСредстваСервер");
	МеханизмыКонфигурации.Вставить("УчетДоходовРасходов", "ДоходыИРасходыСервер");
	МеханизмыКонфигурации.Вставить("УчетИмпорта", "УчетИмпорта");
	МеханизмыКонфигурации.Вставить("УчетНДС", "УчетНДСУП");
	МеханизмыКонфигурации.Вставить("УчетПрочихАктивовПассивов", "ПрочиеАктивыПассивыСервер");
	МеханизмыКонфигурации.Вставить("УчетРабот", "РегистрыНакопления.МатериалыИРаботыВПроизводстве");
	МеханизмыКонфигурации.Вставить("ФинансовыеИнструменты", "РегистрыНакопления.РасчетыПоФинансовымИнструментам");
	МеханизмыКонфигурации.Вставить("ФинансовыйРезультат", "РегистрыНакопления.ФинансовыеРезультаты");
	МеханизмыКонфигурации.Вставить("ЦеныИСкидки", "Ценообразование");
	
	
	МеханизмыКонфигурации.Вставить("ТМЦВЭксплуатации", "ТМЦВЭксплуатацииСервер");
	
	ПроведениеДокументовЛокализация.ДополнитьУчетныеМеханизмыКонфигурации(МеханизмыКонфигурации);
	
	TK_ПроведениеДокументов.ДополнитьУчетныеМеханизмыКонфигурации(МеханизмыКонфигурации);
	
	Возврат МеханизмыКонфигурации;
КонецФункции
