#Область ПрограммныйИнтерфейс

// Копирует текстовое значение в буфер обмена.
// 
// Параметры:
//  HTMLПоле - ПолеФормы - Элементы
//  Текст - Строка - Текст к копированию
Процедура СкопироватьТекстВБуферОбмена(HTMLПоле, Текст) Экспорт

	HTMLДокумент = HTMLПоле.document;
	ВременноеПолеВвода = HTMLДокумент.createElement("INPUT");
	АктивныйЭлемент = HTMLДокумент.activeElement;
	ВременноеПолеВвода.value = Текст;
	HTMLДокумент.body.appendChild(ВременноеПолеВвода);
	ВременноеПолеВвода.select();
	HTMLДокумент.execCommand("copy");
	HTMLДокумент.body.removeChild(ВременноеПолеВвода);
	АктивныйЭлемент.focus();
	ТекстСообщения = НСтр("ru = 'Значение скопировано в буфер обмена.'");

	ПоказатьОповещениеПользователя( , , ТекстСообщения, БиблиотекаКартинок.Успешно32);

КонецПроцедуры

#КонецОбласти