#Область ПрограммныйИнтерфейс

// Установить текст в буфер обмена.
// 
// Параметры:
//  Текст - Строка - текст к копированию в буфер обмена
Процедура УстановитьТекстВБуферОбмена(Текст) Экспорт

	Объект = Новый COMОбъект("htmlfile");
	Объект.ParentWindow.ClipboardData.Setdata("Text", Текст);

	ОбщегоНазначенияКлиент.СообщитьПользователю("Скопировано в буфер обмена!");

КонецПроцедуры

// Открыть ссылку на клиенте.
// 
// Параметры:
//  СсылкаНаЗаказ - ДокументСсылка.TK_ЗапросЦенПоставщикам -  Ссылка на заказ
Процедура ОткрытьСсылкуНаКлиенте(СсылкаНаЗаказ) Экспорт

	СсылкаДляЗапуска = TK_ОбщегоНазначенияВызовСервера.ПолучитьСсылкуНаДокумент_ДляЗапуска(СсылкаНаЗаказ);

	ЗапуститьПриложение(СсылкаДляЗапуска);

КонецПроцедуры

#КонецОбласти