#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьОтборОрганизаций();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВыполнить(Команда)

	Если ЗначениеЗаполнено(Организация) И ЗначениеЗаполнено(СсылкаНаЗаказКлиента) Тогда
		Результат = TK_РаботаСWebВызовСервера.ПолучитьРезультатПолученияЗапросаЦен(Организация, СсылкаНаЗаказКлиента);

		Если Результат.Загружен Тогда
			Закрыть();
			ВызватьИсключение Результат.Сообщение;
		КонецЕсли;

	ИначеЕсли Не ЗначениеЗаполнено(Организация) Тогда
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Укажите организацию.'"));
	Иначе
		ОбщегоНазначенияКлиент.СообщитьПользователю(НСтр("ru = 'Заполните ссылку на заказ клиента'"));
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборОрганизаций()

	МассивОрганизаций = TK_ОбщегоНазначенияВызовСервера.ПолучитьСписокДоступныхОрганизаций();

	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОрганизаций)));

	НовыйПараметр = Новый ФиксированныйМассив(МассивПараметров);

	Элементы.Организация.ПараметрыВыбора = НовыйПараметр;

КонецПроцедуры

#КонецОбласти