#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	УстановитьОтборОрганизаций();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗагрузитьЗапросЦен(Команда)

	Если Не ПроверитьЗаполнение() Тогда
		Возврат;
	КонецЕсли;

	ЗапросЦенОтКлиента = TK_ИнтеграцияСTeklifoВызовСервера.ЗагрузитьЗапросЦенОтКлиентаПоURL(Организация, URLЗапросаОтКлиента);

	Если ЗначениеЗаполнено(ЗапросЦенОтКлиента) Тогда
		ПоказатьЗначение( , ЗапросЦенОтКлиента);
		Закрыть();
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьОтборОрганизаций()

	МассивОрганизаций = TK_ОбщегоНазначенияВызовСервера.организацииДоступныеКОбменуСTeklifo();

	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОрганизаций)));

	НовыйПараметр = Новый ФиксированныйМассив(МассивПараметров);

	Элементы.Организация.ПараметрыВыбора = НовыйПараметр;

КонецПроцедуры

#КонецОбласти