&НаСервере
Процедура УстановитьОтборОрганизаций()
	МассивОрганизаций = TK_ОбщегоНазначенияСервер.ПолучитьСписокДоступныхОрганизаций();

	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОрганизаций)));

	НовыйПараметр = Новый ФиксированныйМассив(МассивПараметров);

	Элементы.Организация.ПараметрыВыбора = НовыйПараметр;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	УстановитьОтборОрганизаций();
КонецПроцедуры

&НаКлиенте
Процедура КомандаВыполнить(Команда)
	Если ЗначениеЗаполнено(Организация)
	И ЗначениеЗаполнено(СсылкаНаЗаказКлиента) Тогда
		Результат = TK_РаботаСWeb.ПолучитьРезультатПолученияЗапросаЦен(СсылкаНаЗаказКлиента, Организация);

		Если Результат.Загружен Тогда
			Закрыть();
			ВызватьИсключение Результат.Сообщение;			
		КонецЕсли
		
	ИначеЕсли Не ЗначениеЗаполнено(Организация) тогда
		Сообщить("Заполните организацию!");
	Иначе
		Сообщить("Заполните ссылку на заказ клиента!");	
	КонецЕсли;
КонецПроцедуры