&НаКлиенте
Асинх Процедура КомандаОпубликовать(Команда)
	Отказ = Ложь;
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Или Модифицированность Тогда
		обещание = ВопросАсинх("Документ не проведен. Провести?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
		Результат = Ждать обещание;
		Если Результат = КодВозвратаДиалога.Да Тогда
			Отказ = Не Записать(Новый Структура("РежимЗаписи", РежимЗаписиДокумента.Проведение));
		Иначе
			Возврат;
		КонецЕсли;
	КонецЕсли;

	Если Не Отказ Тогда
		НачатьПубликацию();
	Иначе
		ВызватьИсключение "Не удалось провести документ";
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Асинх Процедура НачатьПубликацию()

	обещание = ВопросАсинх("Выполнить публикацию документа?", РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Результат = Ждать обещание;
	Если Результат = КодВозвратаДиалога.Да Тогда
		//В случае подтверждения выполняем отправку
		Результат = TK_РаботаСWeb.ПолучитьРезультатОтправкиНоменклатуры(ПолучитьНомнелктуруДокумента(),Объект.Организация )
	КонецЕсли;
КонецПроцедуры	


&НаСервере
Функция ПолучитьНомнелктуруДокумента()
	//Временное решение
	Возврат Объект.Товары.Выгрузить().ВыгрузитьКолонку("Номенклатура");
КонецФункции


// СтандартныеПодсистемы.Печать 
&НаКлиенте
Процедура Подключаемый_ВыполнитьКомандуПечати(Команда)
	УправлениеПечатьюКлиент.ВыполнитьПодключаемуюКомандуПечати(Команда, ЭтаФорма, Объект);
КонецПроцедуры 
// Конец СтандартныеПодсистемы.Печать 
// СтандартныеПодсистемы.ПодключаемыеКоманды 
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры
&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры
&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры 
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры
&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	// СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 
КонецПроцедуры
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
     // СтандартныеПодсистемы.ПодключаемыеКоманды 
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект); 
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды 

	УстановитьОтборОрганизаций();
КонецПроцедуры
&НаСервере
Процедура УстановитьОтборОрганизаций()
	МассивОрганизаций = TK_ОбщегоНазначенияСервер.ПолучитьСписокДоступныхОрганизаций();

	МассивПараметров = Новый Массив;
	МассивПараметров.Добавить(Новый ПараметрВыбора("Отбор.Ссылка", Новый ФиксированныйМассив(МассивОрганизаций)));

	НовыйПараметр = Новый ФиксированныйМассив(МассивПараметров);

	Элементы.Организация.ПараметрыВыбора = НовыйПараметр;
КонецПроцедуры