&НаКлиенте
Процедура КомандаАвторизовация(Команда)
	КомандаАвторизовацияНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаАвторизовацияНаСервере()
	Если Не ЗначениеЗаполнено(СокрЛП(Объект.Email)) Тогда
		Сообщить("Заполните Email!");
		Возврат;
	КонецЕсли;

	СтруктураТокенов = Новый Структура;
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ВыполнитьАвторизацию(СтруктураТокенов, УжеЗарегистрирован);

	Если Не УжеЗарегистрирован Тогда
		ЗарегистрироватьПользователя();
	Иначе
		ДалееЗавершениеВходаНаСервере();
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура КомандаДалееЗавершениеВхода(Команда)
	ДалееЗавершениеВходаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДалееЗавершениеВходаНаСервере()
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаПродолжениеАвторизации;
КонецПроцедуры
&НаСервере
Процедура ДалееИнформацияОбОтправленномПисьме()
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаИнформацияОбОтправленномПисьме;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗавершитьАвторизацию(Команда)
	КомандаЗавершитьАвторизациюНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПолучитьДанныеПользователя()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ТЗОрганизаций = ОбъектОбработки.ПолучитьДанныеПользователя();
	
	значениевреквизитформы(ТЗОрганизаций,"ТаблицаОрганизаций");
	ДалееСтраницаОрганизации();
КонецПроцедуры


&НаСервере
Процедура ДалееСтраницаОрганизации()
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаОрганизации;
КонецПроцедуры


&НаСервере
Процедура КомандаЗавершитьАвторизациюНаСервере()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ТокенСессии = ОбъектОбработки.ПолучитьТокенСессии(СтруктураТокенов);

    Если ТокенСессии <> "" Тогда
    	Сообщить("Авторизация прошла успешно!");
    	ПолучитьДанныеПользователя();
    Иначе
    	Сообщить("Авторизация не выполнена!");	
    КонецЕсли;

КонецПроцедуры
&НаСервере
Процедура ЗарегистрироватьПользователя()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ЗарегистрироватьПользователя(СтруктураТокенов);
	ДалееИнформацияОбОтправленномПисьме();
КонецПроцедуры