
&НаКлиенте
Процедура КомандаАвторизовация(Команда)
	КомандаАвторизовацияНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаАвторизовацияНаСервере()
	Если Не ЗначениеЗаполнено(СокрЛП(Объект.Email)) Тогда
		Сообщить("Заполните Email!");
		Возврат;
	КонецЕсли;
	
	СтруктураТокенов = Новый Структура;
	
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ВыполнитьАвторизацию(СтруктураТокенов,УжеЗарегистрирован);
	
	Если Не УжеЗарегистрирован Тогда
		ЗарегистрироватьПользователя();
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура ЗарегистрироватьПользователя()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ЗарегистрироватьПользователя(СтруктураТокенов);
КонецПроцедуры