&НаКлиенте
Процедура КомандаАвторизовация(Команда)
	КомандаАвторизовацияНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаАвторизовацияНаСервере()
	Если Не ЗначениеЗаполнено(СокрЛП(Объект.Email)) Тогда
		Сообщить("Заполните Email!");
		Возврат;
	КонецЕсли;

	СтруктураТокенов = Новый Структура;
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ВыполнитьАвторизацию(СтруктураТокенов, УжеЗарегистрирован);

	Если Не УжеЗарегистрирован Тогда
		ЗарегистрироватьПользователя();
	Иначе
		ДалееЗавершениеВходаНаСервере();
	КонецЕсли;

КонецПроцедуры
&НаКлиенте
Процедура КомандаДалееЗавершениеВхода(Команда)
	ДалееЗавершениеВходаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДалееЗавершениеВходаНаСервере()
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаПродолжениеАвторизации;
КонецПроцедуры
&НаСервере
Процедура ДалееИнформацияОбОтправленномПисьме()
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаИнформацияОбОтправленномПисьме;
КонецПроцедуры

&НаКлиенте
Процедура КомандаЗавершитьАвторизацию(Команда)
	КомандаЗавершитьАвторизациюНаСервере();
КонецПроцедуры


&НаСервере
Процедура ПолучитьДанныеПользователя()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ТЗОрганизаций = ОбъектОбработки.ПолучитьДанныеПользователя();
	
	значениевреквизитформы(ТЗОрганизаций,"ТаблицаОрганизаций");
	ДалееСтраницаОрганизации();
КонецПроцедуры

&НаКлиенте
Процедура КомандаСохранитьДанные(Команда)
	КомандаСохранитьДанныеНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаСохранитьДанныеНаСервере()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	ТЗОрганизаций = РеквизитФормыВЗначение("ТаблицаОрганизаций");
	
	ОбъектОбработки.ВыполнитьСохранениеДанных(ТЗОрганизаций);
	Сообщить("Данные сохранены успешно!");
КонецПроцедуры


&НаКлиенте
Процедура КомандаСоздатьОрганизациюНаСайте(Команда)
	СоздатьОрганизациюНаСайте();
КонецПроцедуры

&НаСервере
Процедура СоздатьОрганизациюНаСайте()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("id",ИдентификаторНовойОрганизации);
	СтруктураДанных.Вставить("name",НаименованиеНовойОрганизации);
	СтруктураДанных.Вставить("tin",ИНННовойОрганизации);
	СтруктураДанных.Вставить("description",ОписаниеАнгНовойОрганизации);
	СтруктураДанных.Вставить("descriptionRu",ОписаниеРуНовойОрганизации);
	СтруктураДанных.Вставить("slogan",СлоганАнгНовойОрганизации);
	СтруктураДанных.Вставить("sloganRu",СлоганРуНовойОрганизации);
	
	ОбъектОбработки.СоздатьОрганизациюНаСайте(СтруктураДанных,ТокенСессии);
	
	ПолучитьДанныеПользователя();
	
КонецПроцедуры


&НаСервере
Процедура ДалееНоваяОрганизация()
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаНоваяОрганизация;
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаОрганизацийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, ЭтоГруппа, Параметр)
	Перем ВыбЗнач;
	
	Отказ = Истина;
		
	Массив = Новый Массив;
	Массив.Добавить(Тип("СправочникСсылка.Организации"));
		
	ОписаниеТипов = Новый ОписаниеТипов(Массив);
	Оповещение = Новый ОписаниеОповещения("ПослеВводаЗначения", ЭтотОбъект);
	ПоказатьВводЗначения(Оповещение,ВыбЗнач, "Введите значение", ОписаниеТипов);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОтобразитьСтраницуОрганизаций(Команда)
	ДалееСтраницаОрганизации();
КонецПроцедуры



&НаКлиенте
Процедура ПослеВводаЗначения(ВыбЗнач, Параметры) Экспорт
    Если ВыбЗнач<>Неопределено Тогда		
		ВыбраннаяОрганизация1С = ВыбЗнач;
		ЗаполнитьДанныеНовойОрганизации();
		ДалееНоваяОрганизация();
    КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ЗаполнитьДанныеНовойОрганизации()
	НаименованиеНовойОрганизации =  ВыбраннаяОрганизация1С.Наименование;
	ИНННовойОрганизации          = ВыбраннаяОрганизация1С.ИНН;
КонецПроцедуры




&НаСервере
Процедура ДалееСтраницаОрганизации()
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаОрганизации;
КонецПроцедуры


&НаСервере
Процедура КомандаЗавершитьАвторизациюНаСервере()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ТокенСессии = ОбъектОбработки.ПолучитьТокенСессии(СтруктураТокенов);

    Если ТокенСессии <> "" Тогда
    	Сообщить("Авторизация прошла успешно!");
    	ПолучитьДанныеПользователя();
    Иначе
    	Сообщить("Авторизация не выполнена!");	
    КонецЕсли;

КонецПроцедуры
&НаСервере
Процедура ЗарегистрироватьПользователя()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ЗарегистрироватьПользователя(СтруктураТокенов);
	ДалееИнформацияОбОтправленномПисьме();
КонецПроцедуры