
&НаКлиенте
Процедура КомандаАвторизовация(Команда)
	КомандаАвторизовацияНаСервере();
КонецПроцедуры

&НаСервере
Процедура КомандаАвторизовацияНаСервере()
	Если Не ЗначениеЗаполнено(СокрЛП(Объект.Email)) Тогда
		Сообщить("Заполните Email!");
		Возврат;
	КонецЕсли;
	
	СтруктураТокенов = Новый Структура;
	
	
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ВыполнитьАвторизацию(СтруктураТокенов,УжеЗарегистрирован);
	
	Если Не УжеЗарегистрирован Тогда
		ЗарегистрироватьПользователя();
	Иначе
		ДалееЗавершениеВходаНаСервере();	
	КонецЕсли;
	
КонецПроцедуры


&НаКлиенте
Процедура КомандаДалееПродолжениеАвторизации(Команда)
	//TODO: Вставить содержимое обработчика
КонецПроцедуры


&НаКлиенте
Процедура КомандаДалееЗавершениеВхода(Команда)
	ДалееЗавершениеВходаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ДалееЗавершениеВходаНаСервере()
	Элементы.ГруппаСтраниц.ТекущаяСтраница = Элементы.ГруппаПродолжениеАвторизации;
КонецПроцедуры






&НаСервере
Процедура ЗарегистрироватьПользователя()
	ОбъектОбработки = РеквизитФормыВЗначение("Объект");
	ОбъектОбработки.ЗарегистрироватьПользователя(СтруктураТокенов);
КонецПроцедуры