#Область ОбработчикиСобытий

&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Результат = Ждать ВопросАсинх(НСтр("ru = 'Отправить коммерческое предложение клиенту?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

	Результат = ОпубликоватьКоммерческоеПредложениеКлиентуНаTeklifo(ПараметрКоманды);

	Если Результат Тогда
		TK_ОбщегоНазначенияВызовСервера.УстановитьСтатусПубликацииЗаказаЦенПоставщикам(ПараметрКоманды,
			ПредопределенноеЗначение("Перечисление.TK_СтатусыПубликацииДокументовНаTeklifo.Опубликован"));

		ОткрытьФорму("Документ.TK_КоммерческоеПредложениеКлиенту.Форма.ФормаРезультатаПубликаци",
			Новый Структура("ДокументСсылка", ПараметрКоманды));

	КонецЕсли;

	Оповестить("TK_ОбновлениеСтатусаПубликации", ПараметрКоманды);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОпубликоватьКоммерческоеПредложениеКлиентуНаTeklifo(КоммерческоеПредложениеКлиенту)

	Возврат TK_ИнтеграцияСTeklifoВызовСервера.ОпубликоватьКоммерческоеПредложениеКлиентуНаTeklifo(КоммерческоеПредложениеКлиенту);

КонецФункции

#КонецОбласти