#Область ОбработчикиСобытий
Перем ТекСтатус;

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//@skip-check undefined-variable
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	Если Не ЗначениеЗаполнено(ТекСтатус) Тогда
		TK_ОбщегоНазначенияСервер.УстановитьСтатусДокументаЗаказаЦенПоставщику(Ссылка,
			Перечисления.TK_СтатусыДокументаЗапросЦенПоставщикам.НеОпубликован);
	КонецЕсли;

КонецПроцедуры
Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ТекСтатус = TK_ОбщегоНазначенияСервер.ПолучитьСтатусДокументаЗаказаЦенПоставщику(Ссылка);

	Если Не ЭтоНовый() И ТекСтатус
		= Перечисления.TK_СтатусыДокументаЗапросЦенПоставщикам.Опубликован Тогда
		TK_ОбщегоНазначенияСервер.УстановитьСтатусДокументаЗаказаЦенПоставщику(Ссылка,
			Перечисления.TK_СтатусыДокументаЗапросЦенПоставщикам.ТребуетОбновления);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти