#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	//@skip-check undefined-variable
	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры
Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ТекСтатус = TK_ОбщегоНазначенияСервер.ПолучитьСтатусДокументаЗаказаЦенПоставщику(Ссылка);

	Если Не ЗначениеЗаполнено(ТекСтатус) Тогда
		TK_ОбщегоНазначенияСервер.УстановитьСтатусДокументаЗаказаЦенПоставщику(Ссылка,
			Перечисления.TK_СтатусыДокументаЗапросЦенПоставщикам.НеОпубликован);
	КонецЕсли;

КонецПроцедуры
#КонецОбласти