#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)

	Ответственный = Пользователи.ТекущийПользователь();

КонецПроцедуры

Процедура ПриЗаписи(Отказ)

	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ТекущийСтатус = Перечисления.TK_СтатусыДокументаЗапросЦенПоставщикам.ПустаяСсылка();
	ДополнительныеСвойства.Свойство("ТекущийСтатус", ТекущийСтатус);

	Если Не ЗначениеЗаполнено(ТекущийСтатус) Тогда
		TK_ОбщегоНазначенияСервер.УстановитьСтатусДокументаЗаказаЦенПоставщику(Ссылка,
			Перечисления.TK_СтатусыДокументаЗапросЦенПоставщикам.НеОпубликован);
	КонецЕсли;

КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	ТекущийСтатус = TK_ОбщегоНазначенияСервер.ПолучитьСтатусДокументаЗаказаЦенПоставщику(Ссылка);
	ДополнительныеСвойства.Вставить("ТекущийСтатус", ТекущийСтатус);

	Если Не ЭтоНовый() И ТекущийСтатус = Перечисления.TK_СтатусыДокументаЗапросЦенПоставщикам.Опубликован Тогда
		TK_ОбщегоНазначенияСервер.УстановитьСтатусДокументаЗаказаЦенПоставщику(Ссылка,
			Перечисления.TK_СтатусыДокументаЗапросЦенПоставщикам.ТребуетОбновления);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#КонецЕсли