#Область ОбработчикиСобытий

&НаКлиенте
Асинх Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)

	Результат = Ждать ВопросАсинх(НСтр("ru = 'Опубликовать запрос цен на сервисе Teklifo?'"), РежимДиалогаВопрос.ДаНет, , КодВозвратаДиалога.Да);
	Если Результат = КодВозвратаДиалога.Нет Тогда
		Возврат;
	КонецЕсли;

	Результат = ОпубликоватьЗапросЦенПоставщикамНаTeklifo(ПараметрКоманды);

	Если Результат Тогда
		TK_ОбщегоНазначенияВызовСервера.УстановитьСтатусПубликацииЗаказаЦенПоставщикам(ПараметрКоманды,
			ПредопределенноеЗначение("Перечисление.TK_СтатусыПубликацииЗапросовЦен.Опубликован"));

		ОткрытьФорму("Документ.TK_ЗапросЦенПоставщикам.Форма.ФормаРезультатаВыгрузки",
			Новый Структура("ДокументСсылка", ПараметрКоманды));

	КонецЕсли;

	Оповестить("TK_ОбновлениеСтатусаПубликации", ПараметрКоманды);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ОпубликоватьЗапросЦенПоставщикамНаTeklifo(ЗапросЦенПоставщикам)

	Возврат TK_РаботаСWebВызовСервера.ОпубликоватьЗапросЦенПоставщикамНаTeklifo(ЗапросЦенПоставщикам);

КонецФункции

#КонецОбласти