#Область СлужебныйПрограммныйИнтерфейс

// Описывает учетные механизмы используемые в локализуемой конфигурации.
// Параметры:
//  МеханизмыКонфигурации - Структура - список учетных механизмов,
//              где Ключ - имя механизма, а Значение - модуль реализующий интерфейс проведения.
//
Процедура ДополнитьУчетныеМеханизмыКонфигурации(МеханизмыКонфигурации) Экспорт
    //++ Локализация
	МеханизмыКонфигурации.Вставить("TKУчетныйМеханизм", "TKУчетныйМеханизмСервер");
    //-- Локализация
КонецПроцедуры

#КонецОбласти