#Область ПрограммныйИнтерфейс

// Заполнить имя контактного лица.
Процедура ЗаполнитьИмяКонтактногоЛица() Экспорт
	ИмяКонтактногоЛица = Строка(КонтактноеЛицо);
	ЗаполнитьКонтактныеДанные();
КонецПроцедуры

// Заполнить контактные данные.
Процедура ЗаполнитьКонтактныеДанные() Экспорт

	МассивВидов = Новый Массив;
	МассивВидов.Добавить(Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица);
	МассивВидов.Добавить(Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица);

	МассивТипов = Новый Массив;
	МассивТипов.Добавить(Перечисления.ТипыКонтактнойИнформации.АдресЭлектроннойПочты);
	МассивТипов.Добавить(Перечисления.ТипыКонтактнойИнформации.Телефон);
	КонтИнформация = УправлениеКонтактнойИнформацией.КонтактнаяИнформацияОбъектов(КонтактноеЛицо, МассивТипов,
		МассивВидов, ТекущаяДатаСеанса());

	НомерТелефона = "";
	Email         = "";

	Если КонтИнформация.Количество() > 0 Тогда
		ДанныеТелефона  = КонтИнформация.Найти(Справочники.ВидыКонтактнойИнформации.ТелефонКонтактногоЛица, "Вид");

		Если ДанныеТелефона <> Неопределено Тогда
			НомерТелефона = ДанныеТелефона.Представление;
		КонецЕсли;
		ДанныеEmail  = КонтИнформация.Найти(Справочники.ВидыКонтактнойИнформации.EmailКонтактногоЛица, "Вид");

		Если ДанныеEmail <> Неопределено Тогда
			Email = ДанныеEmail.Представление;
		КонецЕсли;

	КонецЕсли;
КонецПроцедуры

#КонецОбласти