
// Получить данные из JSON.
// 
// Параметры:
//  ТелоЗапроса - Строка - Тело запроса
//  ПараметрыДата - Строка - Параметры дата
// 
// Возвращаемое значение:
//  Произвольный - Получить данные из JSON
Функция ПолучитьДанныеИзJSON(ТелоЗапроса="",ПараметрыДата = "") Экспорт
	ЧтениеJSON = Новый ЧтениеJSON;
	ЧтениеJSON.УстановитьСтроку(ТелоЗапроса);

	Возврат ПрочитатьJSON(ЧтениеJSON,,ПараметрыДата);
КонецФункции



// Сериализовать JSON.
// 
// Параметры:
//  ДанныеСериализации - Структура - Данные сериализации:
// 
// Возвращаемое значение:
//  Строка - Сериализовать JSON
Функция СериализоватьJSON(ДанныеСериализации) Экспорт

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку();
	ЗаписатьJSON(ЗаписьJSON, ДанныеСериализации);

	Возврат ЗаписьJSON.Закрыть();
КонецФункции


Функция ПолучитьРезультатОтправкиНоменклатуры(МассивНоменклатуры,Организация) Экспорт
	
	УчетнаяЗапись = ПолучитьУчетнуюЗаписьПоОрганизации(Организация);
	
	СтруктураТокенов = Новый Структура;// Структура 
	
	ОбработкаИнтеграции = Обработки.TK_ОбработкаИнтеграции.Создать();
	ОбработкаИнтеграции.Email = УчетнаяЗапись.Email;
	ОбработкаИнтеграции.Пароль = УчетнаяЗапись.Пароль;
	ОбработкаИнтеграции.ВыполнитьАвторизацию(СтруктураТокенов,Ложь);
	
	ТокенСессии = ОбработкаИнтеграции.ПолучитьТокенСессии(СтруктураТокенов);
	
	Результат = ОбработкаИнтеграции.ПолучитьРезультатОтправкиНоменклатуры(МассивНоменклатуры, ТокенСессии);// Структура
	
	
	Возврат Результат;
	
КонецФункции


// Получить учетную запись по организации.
// 
// Параметры:
//  Организация - СправочникСсылка.Организации
// 
// Возвращаемое значение:
//  СправочникСсылка.TK_УчетныеЗаписиНаСайте, Неопределено - Получить учетную запись по организации
Функция ПолучитьУчетнуюЗаписьПоОрганизации(Организация)
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	TK_СоответствияОрганизаций.УчетнаяЗапись
	|ИЗ
	|	РегистрСведений.TK_СоответствияОрганизаций КАК TK_СоответствияОрганизаций
	|ГДЕ
	|	TK_СоответствияОрганизаций.Организация = &Организация
	|СГРУППИРОВАТЬ ПО
	|	TK_СоответствияОрганизаций.УчетнаяЗапись");
	Запрос.УстановитьПараметр("Организация",Организация );
	Выборка = Запрос.Выполнить().Выбрать();
	Выборка.Следующий();
	
	Возврат Выборка.УчетнаяЗапись;
	
КонецФункции