Перем АдресСервера;

 
 // Выполнить авторизацию.
 Асинх Процедура ВыполнитьАвторизацию() Экспорт
	СоединениеССервером = ПолучитьСоединение();//HTTPСоединение
	
	csrfToken = Ждать ПолучитьcsrfToken(СоединениеССервером);
	
	УжеЗарегистрирован = Ждать ПользовательЗарегистрированВСистеме(СоединениеССервером);
	
КонецПроцедуры

// Пользователь зарегистрирован в системе.
// 
// Параметры:
//  СоединениеССервером - HTTPСоединение - Соединение с сервером
// 
// Возвращаемое значение:
//  Обещание - Пользователь зарегистрирован в системе
Асинх Функция ПользовательЗарегистрированВСистеме(СоединениеССервером)
	
	Заголовки = Новый Соответствие();
	
	Ресурс = "api/user";
	
	HTTPЗапрос = Новый HTTPЗапрос(Ресурс, Заголовки);
	HTTPЗапрос.АдресРесурса = Ресурс + "?email=" + СокрЛП(Email) + "&page=1&limit=10";
	Обещание = СоединениеССервером.ПолучитьАсинх(HTTPЗапрос);
	Результат =  Ждать Обещание;//HTTPОтвет
	Ответ = Результат.ПолучитьТелоКакСтроку();
	
	СтруктураДанных = TK_РаботаСWeb.ПолучитьДанныеИзJSON(Ответ);//Структура
	
	Если СтруктураДанных.Свойство("result") И
	 СтруктураДанных.result.Количество() > 0 Тогда
		Возврат Истина;
	Иначе
        Возврат Ложь;				
	КонецЕсли;
	
	
КонецФункции



 // Получить csrfToken.
 // 
 // Параметры:
 //  СоединениеССервером - HTTPСоединение - Соединение с сервером
 // 
 // Возвращаемое значение:
 //  Обещание - Получитьcsrf token
 Асинх Функция ПолучитьcsrfToken(СоединениеССервером)
	csrfToken = "";
	
	Заголовки = Новый Соответствие();
	
	HTTPЗапрос = Новый HTTPЗапрос("api/auth/csrf", Заголовки);
	Обещание = СоединениеССервером.ПолучитьАсинх(HTTPЗапрос);
	Результат =  Ждать Обещание;//HTTPОтвет
	Ответ = Результат.ПолучитьТелоКакСтроку();
	
	СтруктураДанных = TK_РаботаСWeb.ПолучитьДанныеИзJSON(Ответ);//Структура
	
	Если СтруктураДанных.Свойство("csrfToken") Тогда
		csrfToken = СтруктураДанных.csrfToken;
	КонецЕсли;
	
	Возврат csrfToken;
КонецФункции


// Получить соединение.
// 
// Возвращаемое значение:
//  HTTPСоединение - Получить соединение
Функция ПолучитьСоединение()
	Возврат Новый HTTPСоединение(АдресСервера,,,,,,Новый ЗащищенноеСоединениеOpenSSL());
КонецФункции


АдресСервера = "teklifo.com";


