Перем АдресСервера;


Асинх  Процедура ВыполнитьАвторизацию() Экспорт
	СоединениеССервером = ПолучитьСоединение();//HTTPСоединение
	
	Заголовки = Новый Соответствие();
	
	HTTPЗапрос = Новый HTTPЗапрос("api/auth/csrf", Заголовки);
	Обещание = СоединениеССервером.ПолучитьАсинх(HTTPЗапрос);
	Результат = Ждать Обещание;//HTTPОтвет
	Результат.ПолучитьТелоКакСтроку()
	
КонецПроцедуры


Функция ПолучитьСоединение()
	Возврат Новый HTTPСоединение(АдресСервера,,,,,,Новый ЗащищенноеСоединениеOpenSSL());
КонецФункции


АдресСервера = "teklifo.com";


