#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ДокументСсылка = Неопределено;

	Если Параметры.Свойство("ДокументСсылка", ДокументСсылка) Тогда
		СсылкаНаДокумент = TK_ОбщегоНазначенияВызовСервера.ВнешняяСсылкаНаОпубликованныйДокумент(ДокументСсылка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура СсылкаНаДокументНажатие(Элемент, СтандартнаяОбработка)

	СтандартнаяОбработка = Ложь;

	Если ЗначениеЗаполнено(СсылкаНаДокумент) Тогда
		TK_ОбщегоНазначенияКлиент.ОткрытьСсылкуНаКлиенте(ДокументСсылка);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаСкопироватьСсылкуВБуфер(Команда)

	СсылкаДляЗапуска = TK_ОбщегоНазначенияВызовСервера.ВнешняяСсылкаНаОпубликованныйДокумент(ДокументСсылка);

	TK_ОбщегоНазначенияКлиент.УстановитьТекстВБуферОбмена(СсылкаДляЗапуска);
КонецПроцедуры

&НаКлиенте
Процедура КомандаОк(Команда)

	Закрыть();

КонецПроцедуры

#КонецОбласти