#Область ПрограммныйИнтерфейс
#Область Проведение
// Формирует параметры для проведения документа по регистрам учетного механизма через общий механизм проведения.
//
// Параметры:
//  Документ - ДокументОбъект - записываемый документ
//  Свойства - ФиксированнаяСтруктура - свойства документа (См. ПроведениеДокументов.СвойстваДокумента).
//
// Возвращаемое значение:
//  Структура - параметры учетного механизма (См. ПроведениеДокументов.ПараметрыУчетногоМеханизма()).
//
Функция ПараметрыДляПроведенияДокумента(Документ, Свойства) Экспорт
    Параметры = ПроведениеДокументов.ПараметрыУчетногоМеханизма();
    // Проведение
    Если Свойства.РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
        Параметры.ПодчиненныеРегистры.Добавить(Метаданные.РегистрыСведений.TK_ДанныеКоммерческихПредложенийОтПоставщика);
    КонецЕсли;
    // Контроль
    Если Свойства.РежимЗаписи <> РежимЗаписиДокумента.Запись Тогда
        Параметры.КонтрольныеРегистрыИзменений.Добавить(Метаданные.РегистрыСведений.TK_ДанныеКоммерческихПредложенийОтПоставщика);
    КонецЕсли;
    Возврат Параметры;
КонецФункции
// Процедура формирования движений по подчиненным регистрам
//
// Параметры:
//    ТаблицыДляДвижений - Структура - таблицы данных документа
//    Движения - КоллекцияДвижений - коллекция наборов записей движений документа
//    Отказ - Булево - признак отказа от проведения документа.
//
Процедура ОтразитьДвижения(ТаблицыДляДвижений, Движения, Отказ) Экспорт
    Если Отказ Тогда
        Возврат;
    КонецЕсли;
    ПроведениеДокументов.ОтразитьДвижения(ТаблицыДляДвижений, Движения, "TK_ДанныеКоммерческихПредложенийОтПоставщика");
КонецПроцедуры

// Формирует тексты запросов для контроля изменений записанных движений регистров.
//
// Параметры:
//  Запрос - Запрос - запрос, хранящий параметры используемые в списке запросов
//  ТекстыЗапроса - СписокЗначений - список текстов запросов и их имен.
//  Документ - ДокументОбъект - записываемый документ.
//
Процедура ИнициализироватьДанныеКонтроляИзменений(Запрос, ТекстыЗапроса, Документ) Экспорт
  
КонецПроцедуры

// Выводит сообщения пользователю при наличии ошибок контроля изменений записанных движений регистров.
//
// Параметры:
//  РезультатыКонтроля - Структура - таблицы с результатами контроля изменений
//  Документ - ДокументОбъект - записываемый документ
//  Отказ - Булево - признак отказа от проведения документа.
//
Процедура СообщитьОРезультатахКонтроляИзменений(РезультатыКонтроля, Документ, Отказ) Экспорт
   
КонецПроцедуры

// Дополняет текст запроса механизма проверки даты запрета по таблице изменений.
// 
// Параметры:
//     Запрос - Запрос - используется для установки параметров запроса.
// 
// Возвращаемое значение:
//    Соответствие - соответствие имен таблиц изменения регистров и текстов запросов.
//    
Функция ТекстыЗапросовКонтрольДатыЗапретаПоТаблицеИзменений(Запрос) Экспорт
    СоответствиеТекстовЗапросов = Новый Соответствие();
    Возврат СоответствиеТекстовЗапросов;
КонецФункции
#КонецОбласти
#КонецОбласти