#Область ПрограммныйИнтерфейс

// Определяет список объектов конфигурации, в модулях менеджеров которых предусмотрена процедура 
// ДобавитьКомандыСозданияНаОсновании, формирующая команды создания на основании объектов.
// Синтаксис процедуры ДобавитьКомандыСозданияНаОсновании см. в документации.
//
// Параметры:
//   Объекты - Массив Из ОбъектМетаданныхДокумент - объекты метаданных (ОбъектМетаданных) с командами создания на основании.
//
// Пример:
//  Объекты.Добавить(Метаданные.Справочники.Организации);
//
&После("ПриОпределенииОбъектовСКомандамиСозданияНаОсновании")
Процедура TK_ПриОпределенииОбъектовСКомандамиСозданияНаОсновании(Объекты) Экспорт

	Объекты.Добавить(Метаданные.Документы.TK_КоммерческоеПредложениеКлиенту);
	Объекты.Добавить(Метаданные.Документы.TK_ЗапросЦенОтКлиента);

КонецПроцедуры

#КонецОбласти